/*	华商商圈0
	庆春商圈1
	新塘商圈2
	滨江星光3
	运河商圈4
	钱江新城5
	*/

	var idToImageConflectMap_1 = {
		id: [
			['543e6b370cf2a338bc585aff',
				'543e6b450cf2a338bc585b0f',
				'543e6b510cf2a338bc585b17',
				'543e6b630cf2a338bc585b27',
				'543e6b3e0cf2a338bc585b07',
				'543e6b570cf2a338bc585b1f'
			],
			['543e6b370cf2a338bc585b01',
				'543e6b450cf2a338bc585b11',
				'543e6b510cf2a338bc585b19',
				'543e6b630cf2a338bc585b29',
				'543e6b3e0cf2a338bc585b09',
				'543e6b570cf2a338bc585b21'
			],
			['543e6ba30cf2a338bc585b4a',
				'543e6bb50cf2a338bc585b58',
				'543f838d0cf26623d3409951',
				'543e6bc50cf2a338bc585b66',
				'543e6bad0cf2a338bc585b51',
				'543e6bbc0cf2a338bc585b5f'
			],
			['543e6ba30cf2a338bc585b4b',
				'543e6bb50cf2a338bc585b59',
				'543e6c910cf2a338bc585b6d',
				'543e6bc50cf2a338bc585b67',
				'543e6bad0cf2a338bc585b52',
				'543e6bbc0cf2a338bc585b60'
			],
			['543e6b7b0cf2a338bc585b36',
				'543e6b840cf2a338bc585b3e',
				'543e6b8a0cf2a338bc585b41',
				'543e6b940cf2a338bc585b47',
				'543e6b800cf2a338bc585b3b',
				'543e6b8f0cf2a338bc585b44'
			],
			[
				'543e6ba30cf2a338bc585b4c',
				'543e6bb50cf2a338bc585b5a',
				'543e6c910cf2a338bc585b6e',
				'543e6bc50cf2a338bc585b68',
				'543e6bad0cf2a338bc585b53',
				'543e6bbc0cf2a338bc585b61'
			]
		],
		image: ['X000000008', 'X000000009', 'X000000001', 'X000000002', 'X000000014', 'X000000003'],
		names: ['光明 酸牛奶 190g原味', '乐事 薯片 经典原味75g', '鸡蛋 6枚 8两以上', '明虾 8两', '冰糖有机冬枣 1斤', '仔排 7两'],
		originalPrice: [3.77, 5.07, 5.3, 24, 12, 16.8],
		decountPrice: [1, 1, 1, 19.9, 10.9, 10.9]
	};
	var idToImageConflectMap_2 = {
		id: [
			['543e6b370cf2a338bc585b02',
				'543e6b450cf2a338bc585b12',
				'543e6b510cf2a338bc585b1a',
				'543e6b630cf2a338bc585b2a',
				'543e6b3e0cf2a338bc585b0a',
				'543e6b570cf2a338bc585b22'

			],
			['543e6b370cf2a338bc585b03',
				'543e6b450cf2a338bc585b13',
				'543e6b510cf2a338bc585b1b',
				'543e6b630cf2a338bc585b2b',
				'543e6b3e0cf2a338bc585b0b',
				'543e6b570cf2a338bc585b23'

			],
			['543e6ba30cf2a338bc585b4a',
				'543e6bb50cf2a338bc585b58',
				'543f838d0cf26623d3409951',
				'543e6bc50cf2a338bc585b66',
				'543e6bad0cf2a338bc585b51',
				'543e6bbc0cf2a338bc585b5f'

			],
			['543e6ba30cf2a338bc585b4d',
				'543e6bb50cf2a338bc585b5b',
				'543e6c910cf2a338bc585b6f',
				'543e6bc50cf2a338bc585b69',
				'543e6bad0cf2a338bc585b54',
				'543e6bbc0cf2a338bc585b62'

			],
			['543e6b7b0cf2a338bc585b37',
				'543e6b840cf2a338bc585b3f',
				'543e6b8b0cf2a338bc585b42',
				'543e6b940cf2a338bc585b48',
				'543e6b800cf2a338bc585b3c',
				'543e6b8f0cf2a338bc585b45'

			],
			[
				'543e6ba30cf2a338bc585b4e',
				'543e6bb50cf2a338bc585b5c',
				'543e6c910cf2a338bc585b70',
				'543e6bc50cf2a338bc585b6a',
				'543e6bad0cf2a338bc585b55',
				'543e6bbc0cf2a338bc585b63'

			]
		],
		image: ['X000000010', 'X000000011', 'X000000001', 'X000000004', 'X000000015', 'X000000005'],
		names: ['味全 发酵乳 190g', '萨啦咪 猪肉肠 25g', '鸡蛋 6枚 8两以上', '低密度放养鲫鱼 1条7两以上', '新西兰黄心奇异果 3枚', '里脊肉 0.5斤'],
		originalPrice: [5, 4, 6, 9, 14.98, 10],
		decountPrice: [1, 1, 1, 5.9, 7.5, 5.5]
	};
	var idToImageConflectMap_3 = {
		id: [
			['543e6b370cf2a338bc585b04',
				'543e6b450cf2a338bc585b14',
				'543e6b510cf2a338bc585b1c',
				'543e6b630cf2a338bc585b2c',
				'543e6b3e0cf2a338bc585b0c',
				'543e6b570cf2a338bc585b24'

			],
			['543e6b370cf2a338bc585b05',
				'543e6b450cf2a338bc585b15',
				'543e6b510cf2a338bc585b1d',
				'543e6b630cf2a338bc585b2d',
				'543e6b3e0cf2a338bc585b0d',
				'543e6b570cf2a338bc585b25'

			],
			['543e6ba30cf2a338bc585b4a',
				'543e6bb50cf2a338bc585b58',
				'543f838d0cf26623d3409951',
				'543e6bc50cf2a338bc585b66',
				'543e6bad0cf2a338bc585b51',
				'543e6bbc0cf2a338bc585b5f'

			],
			['543e6ba30cf2a338bc585b4f',
				'543e6bb50cf2a338bc585b5d',
				'543e6c910cf2a338bc585b71',
				'543e6bc50cf2a338bc585b6b',
				'543e6bad0cf2a338bc585b56',
				'543e6bbc0cf2a338bc585b64'

			],
			['543e6b7b0cf2a338bc585b38',
				'543e6b840cf2a338bc585b40',
				'543e6b8b0cf2a338bc585b43',
				'543e6b940cf2a338bc585b49',
				'543e6b800cf2a338bc585b3d',
				'543e6b8f0cf2a338bc585b46'

			],
			[
				'543e6ba30cf2a338bc585b50',
				'543e6bb50cf2a338bc585b5e',
				'543e6c910cf2a338bc585b72',
				'543e6bc50cf2a338bc585b6c',
				'543e6bad0cf2a338bc585b57',
				'543e6bbc0cf2a338bc585b65'

			]
		],
		image: ['X000000012', 'X000000013', 'X000000001', 'X000000006', 'X000000016', 'X000000007'],
		names: ['新希望 柠檬西柚酸牛奶 160g', '脆香米 巧克力脆米心牛奶 24g', '鸡蛋 6枚 8两以上', '鲈鱼 1条 每条9两以上', '越南金火龙果 2只 2斤', '大排 鲜 1斤'],
		originalPrice: [3.3, 3.2, 6, 21.8, 25.6, 17.6],
		decountPrice: [1, 1, 1, 12.8, 12.8, 13.8]
	};
	//10-17 00:00:00   10-19 23:59:59  10-20 00:00:00  10-22 23:59:59  10-23 00:00:00  10-26 23:59:59
	var timeSection = [1413475200000, 1413734399000, 1413734400000, 1413993599000, 1413993600000, 1414339199000]